# SheetNum

## Description
Returns the number of saved views contained within the current document.

```pascal
FUNCTION SheetNum : INTEGER;
```

```python
def vs.SheetNum():
    return INTEGER
```

## See Also
VS Functions:
SheetList

## Version
Availability: from VectorWorks10.0

## Category
* Document Attributes